src/OneSBuild/src/InformationRegisters/РежимыПодключенияВнешнихМодулейВМоделиСервиса/РежимыПодключенияВнешнихМодулейВМоделиСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РежимыПодключенияВнешнихМодулейВМоделиСервиса</name>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>DefinedType.БезопасныйРежим</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеПрограммногоМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипПрограммногоМодуля</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммногоМодуля</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/InformationRegisters/РежимыПодключенияВнешнихМодулейВМоделиСервиса/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
// Булево, Строка, Неопределено - состояние безопасного режима или Неопределено.
//
Функция РежимИсполненияВнешнегоМодуля(Знач ТипПрограммногоМодуля, Знач ИдентификаторПрограммногоМодуля) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.ТипПрограммногоМодуля = ТипПрограммногоМодуля;
	Менеджер.ИдентификаторПрограммногоМодуля = ИдентификаторПрограммногоМодуля;
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		
		Возврат Менеджер.БезопасныйРежим;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
